当前版本修改问题(2020/11/05)

1 县级用户 数据采集 地面调查 数据填报 编辑页面 中确认页面 点击提交 页面报错 
2 县级用户 数据采集 地面调查 数据填报 添加页面 坡度小数点输入不进去
3 国家级用户 灾害应急物资储备库 储备库管理 库名称和库管理员为数字时 编辑页面报错
4 省级用户 社会防治化组织 编辑数据为空时，点击保存并上报后，详情页面数据不修改
5 省级用户 首页 鼠害虫害 绘图颜色优化
6 县级用户 数据采集 发生防治情况 数据查询 年度搜索框换成下拉框
7 县级用户 数据采集 地面调查 数据查询 填报人字段无数据
8 县级用户 数据采集 地面调查 数据查询页面 样地编号搜索BUG
9 县级用户 数据采集 地面调查 数据填报 添加页面 取样信息添加 添加完数据后页面报错
10 省级用户 社会防治化组织 信息管理 编辑页面中数据为空时 编辑不保存。
11 县级用户 社会化防治组织 信息管理 添加和编辑页面 注册地址字段设置成必填项
12 县级用户 数据采集 地面调查 详情页面 取样信息 查看页面数据格式优化
13 省级用户 数据采集 气象管理 状态与详情和编辑页面的状态不一致
14 国家级用 基础知识库 病类信息管理 编辑页面 照片为空 点击删除，页面报错
15 国家级用户 基础知识库 鼠类信息管理 添加页面数据为空时，点击报错页面报错
16 省级用户 数据采集 发生防治情况  数据填报 发生防治年报添加页面省市区无数据
17 省级用户 数据采集 地面调查 数据查询页面中 搜索框不能用  查看页面中审核记录无数据权限
18 市级用户 首页 鼠害和虫害 折线图和 柱状图 是否有数据
19 省级用户 灾害应急物资储备库 调拨审批 审核操作按钮优化
20  省级用户 灾害应急物资储备库 统计页面图表展示的柱状图优化
21  县级用户 数据采集 地面调查 数据填报 添加页面 取样信息添加后编辑两次后，取样面积无数据